{"backend": "tensorflow", "config": {"layers": [{"name": "input_1", "config": {"batch_input_shape": [null, 28, 28, 1], "sparse": false, "name": "input_1", "dtype": "float32"}, "class_name": "InputLayer", "inbound_nodes": []}, {"name": "conv0", "config": {"activity_regularizer": null, "padding": "same", "kernel_regularizer": null, "kernel_constraint": null, "kernel_size": [7, 7], "activation": "linear", "data_format": "channels_last", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "name": "conv0", "strides": [1, 1], "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "filters": 16, "use_bias": true}, "class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "bn0", "config": {"gamma_constraint": null, "center": true, "beta_regularizer": null, "axis": 3, "scale": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "name": "bn0", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "momentum": 0.99, "epsilon": 0.001, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv0", 0, 0, {}]]]}, {"name": "activation_1", "config": {"name": "activation_1", "activation": "relu", "trainable": true}, "class_name": "Activation", "inbound_nodes": [[["bn0", 0, 0, {}]]]}, {"name": "max_pool_1", "config": {"data_format": "channels_last", "padding": "valid", "strides": [2, 2], "pool_size": [2, 2], "name": "max_pool_1", "trainable": true}, "class_name": "MaxPooling2D", "inbound_nodes": [[["activation_1", 0, 0, {}]]]}, {"name": "conv2d_1", "config": {"activity_regularizer": null, "padding": "same", "kernel_regularizer": null, "kernel_constraint": null, "kernel_size": [7, 7], "activation": "linear", "data_format": "channels_last", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "name": "conv2d_1", "strides": [1, 1], "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "filters": 32, "use_bias": true}, "class_name": "Conv2D", "inbound_nodes": [[["max_pool_1", 0, 0, {}]]]}, {"name": "batch_normalization_1", "config": {"gamma_constraint": null, "center": true, "beta_regularizer": null, "axis": 3, "scale": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "name": "batch_normalization_1", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "momentum": 0.99, "epsilon": 0.001, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"name": "activation_2", "config": {"name": "activation_2", "activation": "relu", "trainable": true}, "class_name": "Activation", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"name": "max_pool_2", "config": {"data_format": "channels_last", "padding": "valid", "strides": [2, 2], "pool_size": [2, 2], "name": "max_pool_2", "trainable": true}, "class_name": "MaxPooling2D", "inbound_nodes": [[["activation_2", 0, 0, {}]]]}, {"name": "conv2d_2", "config": {"activity_regularizer": null, "padding": "valid", "kernel_regularizer": null, "kernel_constraint": null, "kernel_size": [3, 3], "activation": "linear", "data_format": "channels_last", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "name": "conv2d_2", "strides": [1, 1], "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "filters": 16, "use_bias": true}, "class_name": "Conv2D", "inbound_nodes": [[["max_pool_2", 0, 0, {}]]]}, {"name": "batch_normalization_2", "config": {"gamma_constraint": null, "center": true, "beta_regularizer": null, "axis": 3, "scale": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "name": "batch_normalization_2", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "momentum": 0.99, "epsilon": 0.001, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"name": "activation_3", "config": {"name": "activation_3", "activation": "relu", "trainable": true}, "class_name": "Activation", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"name": "max_pooling2d_1", "config": {"data_format": "channels_last", "padding": "valid", "strides": [2, 2], "pool_size": [2, 2], "name": "max_pooling2d_1", "trainable": true}, "class_name": "MaxPooling2D", "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"name": "flatten_1", "config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]}, {"name": "dense_1", "config": {"activity_regularizer": null, "kernel_regularizer": null, "activation": "sigmoid", "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_1", "bias_regularizer": null, "bias_constraint": null, "units": 256, "trainable": true, "use_bias": true}, "class_name": "Dense", "inbound_nodes": [[["flatten_1", 0, 0, {}]]]}, {"name": "dense_2", "config": {"activity_regularizer": null, "kernel_regularizer": null, "activation": "sigmoid", "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_2", "bias_regularizer": null, "bias_constraint": null, "units": 32, "trainable": true, "use_bias": true}, "class_name": "Dense", "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"name": "dense_3", "config": {"activity_regularizer": null, "kernel_regularizer": null, "activation": "softmax", "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_3", "bias_regularizer": null, "bias_constraint": null, "units": 10, "trainable": true, "use_bias": true}, "class_name": "Dense", "inbound_nodes": [[["dense_2", 0, 0, {}]]]}], "name": "HappyModel", "input_layers": [["input_1", 0, 0]], "output_layers": [["dense_3", 0, 0]]}, "class_name": "Model", "keras_version": "2.0.4"}